Revit 2027 API
BuiltInFailures.CurveByPointFailures Class
 Failures about Curve By Point Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.CurveByPointFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class CurveByPointFailures
Public NotInheritable Class CurveByPointFailures
public ref class CurveByPointFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type CurveByPointFailures = class end
The BuiltInFailures.CurveByPointFailures type exposes the following members.
Properties
Name | Description
UnableToGenerateCurve |  Unable to generate valid curve geometry from the driving points. The line by points will be dissolved.
Top
See Also
Reference
Autodesk.Revit.DB Namespace